examples/Wall_beam/fluid-openfoam/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
   p
    {
       solver           GAMG; 
       smoother         GaussSeidel;
       nPreSweeps       2;
       nPostSweeps      2;
       nVcycles         2;
       cacheAgglomeration true;
       nCellsInCoarsestLevel 50;
       agglomerator     faceAreaPair;
       mergeLevels      1;
       tolerance        1e-08;
       relTol           0;
       minIter          1;
   }

   U
    {
     solver           PBiCGStab;
     preconditioner   DILU;
     tolerance        1e-08;
     relTol           0;
     minIter          1;
   }

   pcorr
   {
       solver           GAMG; 
       smoother         GaussSeidel;
       nPreSweeps       2;
       nPostSweeps      2;
       nVcycles         2;
       cacheAgglomeration true;
       nCellsInCoarsestLevel 50;
       agglomerator     faceAreaPair;
       mergeLevels      1;
       tolerance        1e-6;
       relTol           0.01;
       minIter          1;
   }

   pFinal
   {
       solver           GAMG; 
       smoother         GaussSeidel;
       nPreSweeps       2;
       nPostSweeps      2;
       nVcycles         2;
       cacheAgglomeration true;
       nCellsInCoarsestLevel 50;
       agglomerator     faceAreaPair;
       mergeLevels      1;
       tolerance        1e-7;
       relTol           0.01;
       minIter          1;
   }

   UFinal
   {
     solver           PBiCGStab;
     preconditioner   DILU;
     tolerance        1e-6;
     relTol           0.1;
     minIter          1;
   }

   pcorrFinal
   {
       solver           GAMG; 
       smoother         GaussSeidel;
       nPreSweeps       2;
       nPostSweeps      2;
       nVcycles         2;
       cacheAgglomeration true;
       nCellsInCoarsestLevel 50;
       agglomerator     faceAreaPair;
       mergeLevels      1;
       tolerance        1e-6;
       relTol           0.01;
       minIter          1;
   }

    cellDisplacement
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.0001;
        minIter         2;
    }
    cellDisplacementFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
        minIter         2;
    }
}

PIMPLE
{
    nOuterCorrectors	10;
    nCorrectors 2;
    nNonOrthogonalCorrectors 1;
    // tolerance 1.0e-14;
    // relTol 5e-3;
    consistent  true;
    correctPhi  true;
    momentumPredictor true; 
}

PISO
{
    nNonOrthogonalCorrectors 1;
}
potentialFlow
{
    nNonOrthogonalCorrectors 1;
}
